<template>
    <div class="placeDrop-com">
        <div class="">
            <span id="drag-icon">
                <svg xmlns="http://www.w3.org/2000/svg" width="23" fill="#454e80" viewBox="0 0 512 512">
                    <path d="M512 256c0 6.797-2.891 13.28-7.938 17.84l-80 72C419.6 349.9 413.8 352 408 352c-3.312 0-6.625-.6875-9.766-2.078C389.6 346.1 384 337.5 384 328v-48h-104V384l47.1 .0026c9.484 0 18.06 5.578 21.92 14.23s2.25 18.78-4.078 25.83l-72 80C269.3 509.1 262.8 512 255.1 512s-13.28-2.89-17.84-7.937l-71.1-80c-6.328-7.047-7.938-17.17-4.078-25.83s12.44-14.23 21.92-14.23L232 384V280H128v48c0 9.484-5.578 18.06-14.23 21.92C110.6 351.3 107.3 352 104 352c-5.812 0-11.56-2.109-16.06-6.156l-80-72C2.891 269.3 0 262.8 0 256s2.891-13.28 7.938-17.84l80-72C95 159.8 105.1 158.3 113.8 162.1C122.4 165.9 128 174.5 128 184v48h104V128L183.1 128c-9.484 0-18.06-5.578-21.92-14.23S159.8 94.99 166.2 87.94l71.1-80c9.125-10.09 26.56-10.09 35.69 0l72 80c6.328 7.047 7.938 17.17 4.078 25.83s-12.44 14.23-21.92 14.23L280 128v104H384v-48c0-9.484 5.578-18.06 14.23-21.92c8.656-3.812 18.77-2.266 25.83 4.078l80 72C509.1 242.7 512 249.2 512 256z"/>
                </svg>
            </span>
        </div>
        <div>اولین عنصر را از منو سمت راست اینجا قرار دهید.</div>
    </div>
</template>


<style scoped>
.placeDrop-com{
    padding: 45px 20px;
    margin: 40px 60px;
    border-radius: 10px;
    color: #636a96;
    background-color: #f3f3fe;
    border: 2px dashed #c8ceed;
    display: flex;
    align-items: center;
    justify-content: center;
    gap: 8px;
}
#drag-icon{
    display: flex;

}
@media (max-width : 640px){
    .placeDrop-com{
        margin: 0 0 12px 0;
    }
}
</style>